/*1. Записать массив целых чисел в двоичный поток. Прочитать массив целых чисел из
двоичного потока. Предполагается, что до чтения массив уже создан, нужно прочитать n
чисел, где n — длина массива.
2. Аналогично, используя символьные потоки. В потоке числа должны разделяться
пробелами.
3. Используя класс RandomAccessFile, прочитайте массив целых чисел, начиная с заданной
позиции.
4. Используя класс File, получите список всех файлов с заданным расширением в заданном
каталоге (поиск в подкаталогах выполнять не надо).
6. Написать классы:
 Person (человек), содержит Ф.И.О. (раздельно), дату рождения,
 Flat (квартира), содержит номер, площадь, данные о владельцах (список людей),
 House (дом), содержит кадастровый номер дома (строка), адрес, старшего по дому
(человек), список квартир.
В этих классах предусмотреть нужные конструкторы, геттеры, equals и hashCode.
Напишите сервисный класс с методами, которые сериализуют и десериализуют объект типа
House в заданный поток средствами Java.
8. Подключите к проекту библиотеку Jackson. Напишите методы сериализации /
десериализации объектов типа House в строки. Используйте data binding.*/
package org.example;
import java.io.FileReader;
import java.io.FileWriter;
import java.io.IOException;

public class Main {
    public static void main(String[] args) {
        System.out.println(123);
    }
    int[] array = new int[10];

    WriterReader wr = new WriterReader();


}
